ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
  // Messages are dequeued as soon as they're fully add()'ed, not on ack --
  // an ack only ever matters here as a sign that space() may have grown.
  _runQueue(lock);
}

void AsyncWebSocketClient::_onPoll() {
  asyncsrv::unique_lock_type lock(_queue_lock);

  if (!_client) {
    return;
  }

  if (_client && _client->canSend() && (!_controlQueue.empty() || !_messageQueue.empty())) {
    _runQueue(lock);
  } else if (_keepAlivePeriod > 0 && (millis() - _lastMessageTime) >= _keepAlivePeriod && (_controlQueue.empty() && _messageQueue.empty())) {
    lock.unlock();
    ping((uint8_t *)AWSC_PING_PAYLOAD, AWSC_PING_PAYLOAD_LEN);
  }
}

void AsyncWebSocketClient::_runQueue(asyncsrv::unique_lock_type &lock) {
  // all calls to this method MUST be protected by a mutex lock, passed in as `lock`
  if (!_client) {
    return;
  }

  bool needs_send = false;
  while (true) {
    if (_frameSent == 0) {
      // idle: pick the next target by priority (control first)
      if (!_controlQueue.empty()) {
        _sendingControl = true;
      } else if (!_messageQueue.empty()) {
        _sendingControl = false;
      } else {
        break;  // nothing queued
      }

      AsyncWebSocketMessage &target = _sendingControl ? _controlQueue.front() : _messageQueue.front();
      if (_sendingControl) {
        _framePayloadLen = target.size();
      } else {
        const size_t window = webSocketSendFrameWindow(_client);
        if (!window) {
          break;  // no space to send right now
        }
        const size_t remaining = target.size() - _sent;
        _framePayloadLen = std::min(remaining, window);
      }
      if (target.mask()) {
        _maskKey[0] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
        _maskKey[1] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
        _maskKey[2] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
        _maskKey[3] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
      }
    }

    AsyncWebSocketMessage &target = _sendingControl ? _controlQueue.front() : _messageQueue.front();
    const bool final = _sendingControl || (_sent + _framePayloadLen == target.size());
    const uint8_t frameOpcode = (_sendingControl || _sent == 0) ? target.opcode() : (uint8_t)WS_CONTINUATION;
    uint8_t *payload = target.data();

    // Avoid UB pointer arithmetic if payload is nullptr
    if (payload && !_sendingControl) {
      payload += _sent;
    }

    const size_t added = webSocketAddFrame(_client, final, frameOpcode, target.mask(), _maskKey, payload, _framePayloadLen, _frameSent);

    async_ws_log_v(
      "[%s][%" PRIu32 "][%" PRIu8 "] SEND ctrl:%d %u/%u added %u", _server->url(), _clientId, frameOpcode, _sendingControl, _frameSent,
      webSocketFrameHeaderLen(_framePayloadLen, target.mask()) + _framePayloadLen, added
    );

    _frameSent += added;
    needs_send |= (added > 0);

    const size_t frameLen = webSocketFrameHeaderLen(_framePayloadLen, target.mask()) + _framePayloadLen;
    if (_frameSent < frameLen) {
      break;  // stalled; resume on the next trigger
    }

    // frame fully committed to TCP -- done with it, regardless of ack
    _frameSent = 0;
    const size_t framePayloadLen = _framePayloadLen;
    _framePayloadLen = 0;

    if (_sendingControl) {
      const uint8_t opcode = target.opcode();
      _controlQueue.pop_front();
      if (opcode == WS_DISCONNECT && _status == WS_DISCONNECTING) {
        _status = WS_DISCONNECTED;
        async_ws_log_v("[%s][%" PRIu32 "] DISCONNECT SENT", _server->url(), _clientId);
        // Capture _client before unlocking: close() may synchronously run
        // _onDisconnect() -> AsyncWebSocket::_handleDisconnect() -> list::erase(),
        // destroying *this -- nothing after unlock() may touch any member.
        // close() itself (not abort()) hands the pcb to lwIP's graceful
        // close, which flushes/retransmits already-add()'ed data (this
        // close frame included) independent of our lifetime from here on.
        AsyncClient *c = _client;
        lock.unlock();
        c->send();  // Needed on some backends (e.g. SSL) to flush the close frame out before closing
        c->close();
        return;
      }
    } else {
      _sent += framePayloadLen;
      if (_sent >= target.size()) {
        _messageQueue.pop_front();
        _sent = 0;
      }
    }
  }

  if (needs_send) {
    _client->send();
  }
}

bool AsyncWebSocketClient::queueIsFull() const {
  asyncsrv::lock_guard_type lock(_queue_lock);
  return (_messageQueue.size() >= WS_MAX_QUEUED_MESSAGES) || (_status != WS_CONNECTED);
}

size_t AsyncWebSocketClient::queueLen() const {
  asyncsrv::lock_guard_type lock(_queue_lock);
  return _messageQueue.size();
}

bool AsyncWebSocketClient::canSend() const {
  asyncsrv::lock_guard_type lock(_queue_lock);
  return _messageQueue.size() < WS_MAX_QUEUED_MESSAGES;
}

bool AsyncWebSocketClient::_queueControl(uint8_t opcode, const uint8_t *data, size_t len, bool mask) {
  asyncsrv::unique_lock_type lock(_queue_lock);

  if (!_client) {
    return false;
  }

  if (!data) {
    len = 0;
  } else if (len > 125) {
    len = 125;
  }
  AsyncWebSocketSharedBuffer buffer = len ? makeSharedBuffer(data, len) : AsyncWebSocketSharedBuffer{};
  _controlQueue.emplace_back(buffer, opcode, len && mask);
  async_ws_log_v("[%s][%" PRIu32 "] QUEUE CTRL (%u) << %" PRIu8, _server->url(), _clientId, _controlQueue.size(), opcode);

  if (_client && _client->canSend()) {
    _runQueue(lock);
  }

  return true;
}

bool AsyncWebSocketClient::_queueMessage(AsyncWebSocketSharedBuffer buffer, uint8_t opcode, bool mask) {
  asyncsrv::unique_lock_type lock(_queue_lock);

  if (!_client || !buffer || buffer->empty() || _status != WS_CONNECTED) {
    return false;
  }

  if (_messageQueue.size() >= WS_MAX_QUEUED_MESSAGES) {
    if (_closeWhenFull) {
      _status = WS_DISCONNECTED;

      async_ws_log_w("[%s][%" PRIu32 "] Too many messages queued: closing connection", _server->url(), _clientId);

      // Capture _client before unlocking: _client->close() triggers the _onDisconnect() --> _handleDisconnect() --> ~AsyncWebSocketClient() chain,
      // so we must not access any member after unlock.
      AsyncClient *c = _client;
      if (c) {
        lock.unlock();
        c->close();
      }

    } else {
      async_ws_log_w("[%s][%" PRIu32 "] Too many messages queued: discarding new message", _server->url(), _clientId);
    }

