ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
      case AwsParseState::Error:
        async_ws_log_v("[%s][%" PRIu32 "] DATA error state, ignoring data len: %" PRIu64, _server->url(), _clientId, plen);
        return;  // ignore any further data
    }  // end switch over _pstate

    if (consume_byte) {
      // Advance the buffer by one byte.  Centralized to save copy-and-paste in so many states.
      data += 1;
      plen -= 1;
    }
  }  // end while(plen > 0)

  // data completely consumed
  if ((_pinfo.opcode == WS_DISCONNECT) && (_pstate == AwsParseState::Mask_0) && (_pinfo.len == 0)) {
    // Safari close frame edge case: masked bit set but no mask data
    async_ws_log_v("[%s][%" PRIu32 "] DATA close frame with incomplete mask, treating as unmasked", _server->url(), _clientId);
    _pinfo.masked = 0;
    _pstate = AwsParseState::Payload;
  }

  // A zero-length frame could be at the end of the packet; dispatch it now.
  if ((_pstate == AwsParseState::Payload) && (_pinfo.len == 0)) {
    if (!_handleClientFrame(data, 0, true)) {
      return;
    }
    _pstate = AwsParseState::Start;
  }
}

bool AsyncWebSocketClient::_handleClientFrame(uint8_t *data, size_t datalen, bool last) {
  // Process a frame from the client.  Header information is stored in _pinfo.
  // Returns true on successful handling, false on error.

  if (_pinfo.masked) {
    for (size_t i = 0; i < datalen; i++) {
      data[i] ^= _pinfo.mask[(_pinfo.index + i) % 4];
    }
  }

  if (_pinfo.index == 0) {  // first fragment of the frame
    // init message_opcode for this frame
    // note: For next WS_CONTINUATION frames, they have opcode 0, so message_opcode will stay like the first frame
    if (_pinfo.opcode == WS_TEXT || _pinfo.opcode == WS_BINARY) {
      _pinfo.message_opcode = _pinfo.opcode;
    }
    // init frame number to 0 if only 1 frame or if this is the first frame of a fragmented message
    if (_pinfo.final || datalen < _pinfo.len) {
      _pinfo.num = 0;
    }
  }

  if ((datalen + _pinfo.index) < _pinfo.len) {  // more fragments to read for this frame
    if (datalen > 0) {
      if (_pinfo.opcode < WS_DISCONNECT) {  // continuation or text/binary frame
        async_ws_log_v(
          "[%s][%" PRIu32 "] DATA processing next fragment of %s frame %" PRIu32 ", index: %" PRIu64 ", len: %" PRIu32 "", _server->url(), _clientId,
          (_pinfo.message_opcode == WS_TEXT) ? "text" : "binary", _pinfo.num, _pinfo.index, (uint32_t)datalen
        );
        if (!_handleDataEvent(data, datalen, last)) {
          return false;  // stop processing on failure
        }
      } else {
        // Control frame fragmented across TCP packets.  We must buffer the data until we have the complete frame.
        if (!_pbuffer) {
          uint8_t *pbuf = new (std::nothrow) uint8_t[(size_t)_pinfo.len];  // cast is safe because _pinfo.len is guaranteed to be <= 125 for control frames
          if (!pbuf) {
            async_ws_log_e("[%s][%" PRIu32 "] DATA failed to allocate buffer for control frame", _server->url(), _clientId);
            close(WS_CLOSE_INTERNAL_ERROR, nullptr);  // Close the connection with a protocol error code
            _pstate = AwsParseState::Error;
            return false;
          }
          _pbuffer.reset(pbuf);
        }
        // Save data in buffer
        memcpy(_pbuffer.get() + _pinfo.index, data, datalen);
      }

      // track index for next fragment
      _pinfo.index += datalen;
    }
  } else if ((datalen + _pinfo.index) == _pinfo.len) {  // this is the last fragment for this frame
    if (_pinfo.opcode < WS_DISCONNECT) {                // most likely case: continuation or text/binary frame
      async_ws_log_v(
        "[%s][%" PRIu32 "] DATA processing final fragment of %s frame %" PRIu32 ", index: %" PRIu64 ", len: %" PRIu32 "", _server->url(), _clientId,
        (_pinfo.message_opcode == WS_TEXT) ? "text" : "binary", _pinfo.num, _pinfo.index, (uint32_t)datalen
      );

      if (!_handleDataEvent(data, datalen, last)) {
        return false;  // stop processing on failure
      }

      if (_pinfo.final) {
        _pinfo.num = 0;
      } else {
        _pinfo.num += 1;
      }
    } else {  // control frame
      if (_pbuffer) {
        memcpy(_pbuffer.get() + _pinfo.index, data, datalen);
        data = _pbuffer.get();
        datalen = _pinfo.len;
      }

      if (_pinfo.opcode == WS_DISCONNECT) {
        async_ws_log_v("[%s][%" PRIu32 "] DATA WS_DISCONNECT", _server->url(), _clientId);

        // Pass up the close frame error information
        if (datalen >= 2) {
          uint16_t reasonCode = (uint16_t)(data[0] << 8) + data[1];
          char *reasonString = (char *)(data + 2);
          if (reasonCode > WS_CLOSE_GOING_AWAY) {
            _server->_handleEvent(this, WS_EVT_ERROR, (void *)&reasonCode, (uint8_t *)reasonString, strnlen(reasonString, datalen - 2));
          }
        }
        if (_status == WS_DISCONNECTING) {
          _status = WS_DISCONNECTED;
          if (_client) {
            _client->close();
          }
          return false;  // our object is now destroyed, so we must return immediately to avoid accessing any member
        } else {
          _status = WS_DISCONNECTING;
          if (_client) {
            _client->ackLater();
          }
          _queueControl(WS_DISCONNECT, data, datalen);
        }

      } else if (_pinfo.opcode == WS_PING) {
        async_ws_log_v("[%s][%" PRIu32 "] DATA PING", _server->url(), _clientId);
        _server->_handleEvent(this, WS_EVT_PING, NULL, NULL, 0);
        _queueControl(WS_PONG, data, datalen);

      } else if (_pinfo.opcode == WS_PONG) {
        async_ws_log_v("[%s][%" PRIu32 "] DATA PONG", _server->url(), _clientId);
        if (datalen != AWSC_PING_PAYLOAD_LEN || memcmp(AWSC_PING_PAYLOAD, data, AWSC_PING_PAYLOAD_LEN) != 0) {
          _server->_handleEvent(this, WS_EVT_PONG, NULL, data, datalen);
        }
      } else {
        async_ws_log_v("[%s][%" PRIu32 "] DATA unknown control frame: %" PRIu8, _server->url(), _clientId, _pinfo.opcode);
        close(WS_CLOSE_PROTOCOL_ERROR, nullptr);  // Close the connection with a protocol error code
        _pstate = AwsParseState::Error;
        return false;
      }
    }

    _pinfo.index = _pinfo.len;  // mark packet as complete
    _pbuffer.reset();           // free any control frame buffer
  } else {
    // unexpected frame protocol error - how is this possible?
    async_ws_log_v(
      "[%s][%" PRIu32 "] DATA frame error: len: %u, index: %" PRIu64 ", total: %" PRIu64 "\n", _server->url(), _clientId, datalen, _pinfo.index, _pinfo.len
    );

    close(WS_CLOSE_PROTOCOL_ERROR, nullptr);  // Close the connection with a protocol error code
    _pstate = AwsParseState::Error;
    return false;
  }

